rottenpotatoes/app/controllers/movies_controller.rb

def similar#non of this probably works yet, but it should be a step on the right direction
    @movie = Movie.find(params[:id])
    @similar_movies = Movie.where(director: @movie[:director])
    #byebug

    if @similar_movies.length == 1 #sad path
---
SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", 1]]
SELECT "movies".* FROM "movies" WHERE "movies"."director" = ?  [["director", "George Lucas"]]
SELECT "movies".* FROM "movies"